# сначало формируем список гласных буков (строчных и заглавых)
vowel_letters = ['А', 'Е', 'Ё', 'И', 'О', 'У', 'Ы', 'Э', 'Ю', 'Я',
                 'а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я', 
                 ]
# получаем данные от пользователя
text = input('Введите текст: ')
# создаем список и передаем в него гласные буквы
sorted_list = [vowels for vowels in text if vowels in vowel_letters]
# выводим получивнийся список и количество букв
print('Список гласных букв: ', sorted_list)
print('Длина списка: ', len(sorted_list))

# не вижу смысла тут делать функцию, только увеличит код программы.