shop = [['каретка', 1200], ['шатун', 1000], ['седло', 300],
        ['педаль', 100], ['седло', 1500], ['рама', 12000],
        ['обод', 2000], ['шатун', 200], ['седло', 2700]]

# запрашиваем название детали и создаем контейнера под счет суммы и деталей
detail = input('Название детали: ')
summ = 0
number_of_parts = 0
# проверяем каждой список в общем списке и делаем проверку на схожесть
for product in shop:
    if product[0] == detail:
        summ += product[1]
        number_of_parts += 1
# выводим конечный результат
print('Количество деталей: ', number_of_parts)
print('Общая стоимость: ', summ)
