a = [1, 5, 3]
b = [1, 5, 1, 5]
c = [1, 3, 1, 5, 3, 3]
# соединяем список a и b считаем 5ки и выводим данные
a.extend(b)
print('Кол-во цифр 5 при первом объединении:', a.count(5))
# стирвем 5ки из списка при помощи цикла
for variable in a:  # TODO используйте метод count для подсчёта числа элементов равных 5 и тогда не придётся проверять
                    #  на равенство ниже
    if variable == 5:
        a.remove(5)
# соединяем измененные список a и c считаем 3ки и выводим данные
a.extend(c)
print('Кол-во цифр 3 при втором объединении: ', a.count(3))
print('Итоговый список: ', a)
