# список фильмов
films = ['Крепкий орешек', 'Назад в будущее', 'Таксист', 'Леон', 'Богемская рапсодия', 'Город грехов', 'Мементо', 'Отступники', 'Деревня']
# список под любимые фильмы
favorite_movies = []
# запрос на ввод
number_of_movies = int(input('Сколько фильмов вы бы хотели добавить в избранные: '))
# цикл ввода фильмов
for _ in range(number_of_movies):
    film = input('Введите фильм: ')
    # проверка принадлежности ввода к списку
    for i in films:
        if i in film:
            favorite_movies.append(film)
    else:
        print('Такого фильма нет в списках')

print('Любимые фильмы: ', favorite_movies)




