# внес рекомендованные вами измененя, единственное возник вопрос 
# в соответствии с pip8 функции и классы всетху отделяются двумя перекатами
# а снизу одним
# TODO: Рекомендации по отступам по PEP8:
#  - Определения внешних классов и функций окружается двумя пустыми строками (две строки сверху).
#  - Методы внутри класса отделяются одной пустой строкой.
#  - Группы функций можно разделить дополнительной пустой строкой.
#  - Группы связанных строк кода можно отделять пустыми строками для того,
#  чтобы было проще разобраться в логике программы.
#  - Нельзя использовать пустые строки между внешним и вложенным блоком кода.

nice_list = [1, 2, [3, 4], [[5, 6, 7], [8, 9, 10]],
             [[11, 12, 13], [14, 15], [16, 17, 18]]]


def unpacking(nice_list):
    if not nice_list:
        return nice_list
    if isinstance(nice_list[0], list):
        return unpacking(nice_list[0]) + unpacking(nice_list[1:])
    return nice_list[:1] + unpacking(nice_list[1:])


print(unpacking(nice_list))
