# словарь с данными
players = {
    ("Сидоров", "Никита"): 35,
    ("Сидорова", "Алина"): 34,
    ("Сидоров", "Павел"): 10,
    ("Петрова", "Катя"): 25,
    ("Петров", "Сергей"): 30,
    ("Петров", "Алексей"): 18,
    ("Иванов", "Павел"): 9
}
# запрос фамилии
surname = input('Введите фамилию: ')
# здесь мы определяемся с полом, передаем значение
# для второй переменной в зависимости от пола введенного человека
floor_check = ''
if surname.endswith('а'):
    floor_check = surname[:-1]
else:
    floor_check = surname + 'а'
# завершаем программу циклом проверки базы данных и выводом данных
# исзрдя из правил ресского язака что все имена пишутся с большой буквы
# прелобразуем полученные даные в виде (первая буква большая остальные строчные
# не зависимо от ввода
for i, z in players.items():
    if surname.title() in i or floor_check.title() in i:
        print(i, z)
