# запросили у пользователя название файла и создали список запрещенных символов
file_name = input('Введите название файла: ')
forbidden_characters = ['@', '№', '$', '%', '^', '&', '*', '(', ')']
# я решил началь с проверки на расширение файла
if file_name.endswith('.txt') or file_name.endswith('.docx'):
    # далее проверка на нахождение спец символа в начале строки
    for i_name in file_name:
        if i_name in forbidden_characters:
            print('Ошибка: название начинается на один из специальных символов')
            break
    # вывод данных если все прошло верно
    else:
        print('Файл назван верно.')
# вывод ошибки о неверном расширении
else:
    print('Ошибка: неверное расширение файла. Ожидалось .txt или .docx')
